Jajukym/hello-world/Psoc_101_6BLE/PSoC-6-MCU-Pioneer-Kits-master/CY8CKIT-062-BLE Pioneer Kit/CE218133_EINK_CapSense/CE218133_EINK_CapSense.cydsn/codegentemp/cyfitter_sysint.h
/*******************************************************************************
* File Name: cyfitter_sysint.h
* 
* PSoC Creator  4.2
*
* Description:
* 
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2018 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#ifndef INCLUDED_CYFITTER_SYSINT_H
#define INCLUDED_CYFITTER_SYSINT_H
#include "cy_device_headers.h"

/* CapSense_ISR */
#define CapSense_ISR__INTC_CORTEXM0P_ASSIGNED 1
#define CapSense_ISR__INTC_CORTEXM0P_MUX 3u
#define CapSense_ISR__INTC_CORTEXM0P_PRIORITY 2u
#define CapSense_ISR__INTC_NUMBER 49u
#define CapSense_ISR_INTC_CORTEXM0P_ASSIGNED 1
#define CapSense_ISR_INTC_CORTEXM0P_MUX 3u
#define CapSense_ISR_INTC_CORTEXM0P_PRIORITY 2u
#define CapSense_ISR_INTC_NUMBER 49u

/* CY_EINK_SPIM_SCB_IRQ */
#define CY_EINK_SPIM_SCB_IRQ__INTC_CORTEXM0P_ASSIGNED 1
#define CY_EINK_SPIM_SCB_IRQ__INTC_CORTEXM0P_MUX 4u
#define CY_EINK_SPIM_SCB_IRQ__INTC_CORTEXM0P_PRIORITY 3u
#define CY_EINK_SPIM_SCB_IRQ__INTC_NUMBER 47u
#define CY_EINK_SPIM_SCB_IRQ_INTC_CORTEXM0P_ASSIGNED 1
#define CY_EINK_SPIM_SCB_IRQ_INTC_CORTEXM0P_MUX 4u
#define CY_EINK_SPIM_SCB_IRQ_INTC_CORTEXM0P_PRIORITY 3u
#define CY_EINK_SPIM_SCB_IRQ_INTC_NUMBER 47u

#endif /* INCLUDED_CYFITTER_SYSINT_H */
